Repository: pedrorocha-net/Drupal-BR-Commons
Catalog: profiles/drupal_commons/modules/contrib/getid3/translations/*.po
Languages: pt_br

source: To use this module you'll need to <a href='!download-link'>download the library</a> from the <a href='!info-link'>getID3 website</a> and extract the contents into the module's getid3 directory. Currently, the recommended version of the getID3 library is %recommended-version.
pt_br: Para usar esse módulo você precisará <a href='!download-link'>baixar a biblioteca</a> da <a href='!info-link'>página do getID3</a> e extrair o conteúdo no diretório do módulo getID3. Atualmente, a versão recomendada do getID3 é a %recommended-version.

source: The getID3() module cannot find the getID3 library used to read and write ID3 tags. The site administrator will need to verify that it is installed and then update the <a href='!admin-settings-audio-getid3'>settings</a>.
pt_br: O módulo getid3() não pode encontrar a biblioteca getid3 utilizada para ler e escrever tags ID3. O administrador do site deverá verificar se está instalada e então atualizar as <a href='!admin-settings-audio-getid3'>configurações</a>.

source: Path
pt_br: Endereço

source: The location where getID3() is installed. Relative paths are from the Drupal root directory.
pt_br: O local em que o getID3() está instalado. Caminhos endereços relativos são em relação ao diretório raiz do drupal.

source: Version
pt_br: Versão

source: If you're seeing this it indicates that the getID3 library was found.
pt_br: Se você está vendo essa mensagem é porque a biblioteca getID3 não foi encontrada.

source: Your getID3 library is insecure! The demos distributed with getID3 contains code which creates a huge security hole. Remove the demos directory (%path) from beneth Drupal's directory.
pt_br: Sua biblioteca getID3 é insegura! As demonstrações distribuídas com o getID3 contém códigos que criam uma grande falha de segurança. Remova o diretório de demos (%path) de dentro do diretório do Drupal.

source: Display Warnings
pt_br: Mostrar alertas

source: Check this to display the warning messages from the getID3 library when reading and writing ID3 tags. Generally it's a good idea to leave this unchecked, getID3 reports warnings for several trivial problems and the warnings can be confusing to users. This setting can be useful when debugging problems with the ID3 tags.
pt_br: Marque aqui para mostrar as mensagens de alerta da biblioteca getID3 quando este estiver lendo e escrevendo tags ID3. Geralmente é uma boa idéia deixar essa configuração desmarcada; getID3 relata alertas de vários problemas triviais e esses alertas podem confundir os usuários. Essa configuração pode ser útil para depurar problemas com as tags ID3.

source: The getID3 files <em>getid3.php</em> and <em>write.php</em> could not be found in the %path directory.
pt_br: Os arquivos getID3 <em>getid3.php</em> e <em>write.php</em> não foram encontrados no diretório %path.

source: Configure settings associated with getID3().
pt_br: Configurações associadas com getID3().

source: Setting the module weight of getID3 failed.
pt_br: O ajuste do peso do módulo getID3 falhou.

source: Not found or wrong version
pt_br: Não encontrado ou versão errada

source: You must install <a href="@getid3">getID3()</a> to %getid3dir, or <a href="@getid3settings">configure its installation path</a>.
pt_br: Você deve instalar o <a href="@getid3">getID3()</a> em %getid3dir, ou <a href="@getid3settings">configurar seu endereço de instalação</a>.

source: getID3() extracts useful information from multimedia file formats.
pt_br: getID3() extrai informação útil dos formatos dos arquivos multimídia.
